[
    {
        id: 1,
        title: "device orientation",
        dateCreation: "2012-07-09",
        description: "This cookbook is intended to give an overall introduction to the design and development of applications based on the HTML5 environment that requires add the functionality of detecting the device orientation into their web project. An initial set of recipes aimed at introducing the DeviceOrientation Events will be presented. A second set of recipes illustrating the DevideMotion Events will also be presented",
        ranking: 2, 
        ranking_img_url_small: "resources/images/stars_small_2.png",
    },
    {
        id: 2,
        title: "offline synchro",
        dateCreation: "2012-07-10",
        description: "This cookbook presents the answers or solutions of the requirements related to the area of syncronization the application offline. Reference is made to the persistence of html5 feature and and other technologies that are part of the tools used in the development of the software",
        ranking: 3,
        ranking_img_url_small: "resources/images/stars_small_3.png",
    },
{
        id: 3,
        title: "sencha",
        dateCreation: "2012-07-11",
        description: "Bla Bla Bla Bla...",
        ranking: 3,
        ranking_img_url_small: "resources/images/stars_small_3.png",
    },
{
        id: 4,
        title: "multimedia",
        dateCreation: "2012-07-11",
        description: "Este libro de cocina está destinado a dar una introducción general para el diseño y desarrollo de aplicaciones basadas en el entorno de HTML5 que requiere agregar la funcionalidad de contenido multimedia en su proyecto web. Un primer conjunto de recetas destinadas a la introducción de la carga de contenido multimedia, describe como dar soporte multimedia, permitiendo la reproducción de archivos de audio/vídeo, o bien la conexión y reproducción de una fuente de audio/vídeo",
        ranking: 3,
        ranking_img_url_small: "resources/images/stars_small_3.png",
    },
{
        id: 5,
        title: "touch events",
        dateCreation: "2012-07-11",
        description: "This cookbook is intended to give an overall introduction to the design and development of applications based on the HTML5 environment that requires add the functionality of managing touch events into their web project. An initial set of recipes aimed at introducing the Touch Events will be presented",
        ranking: 3,
        ranking_img_url_small: "resources/images/stars_small_3.png",
    },
{
        id: 6,
        title: "jquery mobile",
        dateCreation: "2012-07-11",
        description: "jQuery Mobile Framework es un producto que sin duda va a dar mucho que hablar en los próximos años. Estamos asistiendo a la revolución de los dispositivos móviles de acceso a Internet y este framework, basado en el popular jQuery, se va a convertir en el mejor aliado para el desarrollo de sitios web orientados para al segmento de consumidores web en movilidad",
        ranking: 3,
        ranking_img_url_small: "resources/images/stars_small_3.png",
    },
{
        id: 7,
        title: "mobile and context aware",
        dateCreation: "2012-07-11",
        description: "Este cookbook tiene la finalidad de mostrar como analizar el contexto en el que se encuentre un dispositivo utilizando HTML5, con la finalidad de responder a las necesidades de la aplicación",
        ranking: 3,
        ranking_img_url_small: "resources/images/stars_small_3.png",
    },
{
        id: 8,
        title: "authentication",
        dateCreation: "2012-07-11",
        description: "Authentication is an important part of Web applications, often needed to offer customized features to users. A new way to provide such a process in a simple fashion for users is to use the single sign-on mechanism. The user has just to remember one login got from a service provider, and is able to use it in any Web application implementing this technology",
        ranking: 3,
        ranking_img_url_small: "resources/images/stars_small_3.png",
    }
]